---
kind: type
id: T:Autodesk.Revit.DB.FabricationHostedInfo
source: html/c74f8adf-a227-098c-b58c-a2998560c0d3.htm
---
# Autodesk.Revit.DB.FabricationHostedInfo

The fabrication hosted element information.

## Syntax (C#)
```csharp
public class FabricationHostedInfo : IDisposable
```

## Remarks
A fabrication part may have a host, the FabricationHostedInfo stores the host information for the fabrication part.